app/controllers/leads_controller.rb

  def index
    leads = current_user.leads.includes(:tags, :interactions)
---
SELECT "interactions".* FROM "interactions" WHERE "interactions"."lead_id" IN (?, ?, ?)  [["lead_id", 1], ["lead_id", 2], ["lead_id", 3]]
SELECT "lead_tags".* FROM "lead_tags" WHERE "lead_tags"."lead_id" IN (?, ?, ?)  [["lead_id", 1], ["lead_id", 2], ["lead_id", 3]]
SELECT "leads".* FROM "leads" WHERE "leads"."user_id" = ?  [["user_id", 1]]

  def create
    lead = current_user.leads.build(lead_params)
    if lead.save
---
INSERT INTO "leads" ("company", "created_at", "email", "estimated_value", "name", "notes", "phone", "status", "updated_at", "user_id", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    if @lead.update(lead_params)
---
UPDATE "leads" SET "name" = ?, "updated_at" = ? WHERE "leads"."id" = ?  [["name", "Updated Lead"], ["updated_at", "2026-01-13 20:48:05.262732"], ["id", 1]]

  def destroy
    @lead.destroy
---
DELETE FROM "leads" WHERE "leads"."id" = ?  [["id", 1]]

  def update_status
    if @lead.update(status: params[:status])
---
UPDATE "leads" SET "status" = ?, "updated_at" = ? WHERE "leads"."id" = ?  [["status", "contacted"], ["updated_at", "2026-01-13 20:48:05.337261"], ["id", 1]]

  def kanban
    leads_by_status = Lead::STATUSES.each_with_object({}) do |status, hash|
      hash[status] = current_user.leads.by_status(status).includes(:tags).map { |lead| lead_response(lead) }
---
SELECT "lead_tags".* FROM "lead_tags" WHERE "lead_tags"."lead_id" = ?  [["lead_id", 1]]
SELECT "leads".* FROM "leads" WHERE "leads"."user_id" = ? AND "leads"."status" = ?  [["user_id", 1], ["status", "new"]]

  def set_lead
    @lead = current_user.leads.find(params[:id])
---
SELECT "leads".* FROM "leads" WHERE "leads"."user_id" = ? AND "leads"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]